#### **1. Executive Performance Dashboard**
**Мета:** Цей інтерактивний дашборд розроблений для топменеджменту з метою моніторингу KPI, аналізу прибутковості та виявлення факторів, що впливають на фінансовий результат компанії. Інструмент дозволяє переходити від загальних цифр до детального аудиту окремих транзакцій.

Сторінка **Executive Summary** є центральною панеллю управління, яка забезпечує стратегічний огляд стану бізнесу та дозволяє миттєво оцінити KPI:
1. Панель ключових показників (KPI) та інтерактивність
   На сторінці представлено чотири основні метрики:
    - Total Revenue: $2,30M (динаміка -29,2%).
    - Gross Profit: $286K (ріст +4,5%).
    - Margin, %: 12,5% (ріст +62,4%).
    - Active Customer Base: 793 (ріст +58,8%).

<img width="1177" height="659" alt="зображення" src="https://github.com/user-attachments/assets/c13b5206-4fcd-4945-87a0-ed6eeb617914" />

При натисканні на будь-яку KPI-картку всі графіки на сторінці автоматично перебудовуються, відображаючи дані саме для обраної метрики. Спарклайни (міні-графіки) на самих картках демонструють динаміку тільки за поточний рік.

2. Аналіз глобальних трендів та Drill-down
   * Центральний візуал відображає дані за всі доступні роки, що дозволяє відстежувати довгострокову динаміку.
   * Контекстні підказки (Tooltips): При наведенні на графік тренду з’являється розширена підказка, яка показує розподіл прибутку за регіонами та сегментами, а також список топ-3 клієнтів за маржею та категорію товарів, які вони купують найчастіше.

<img width="693" height="479" alt="зображення" src="https://github.com/user-attachments/assets/704d854f-f1f1-49e2-a6d9-de874963b0c2" />

   * Деталізація до транзакцій: у верхньому правому куті візуала розташована кнопка, яка відкриває Financial Performance Matrix. У цій матриці можна розгорнути дані від року до конкретної дати замовлення та назви продукту.

<img width="1177" height="660" alt="зображення" src="https://github.com/user-attachments/assets/14df8f5b-65ce-46f6-aa48-6f3d4c113d1f" />

3. Регіональна ефективність та факторний аналіз
   * Топ-5 міст: гістограма показує міста з найбільшим внеском у обраний показник. Наприклад, п'ять ключових міст забезпечують 53,2% валового прибутку. Тултіп на цьому графіку відображає динаміку показника за днями тижня, допомагаючи виявити патерни активності клієнтів.
     
 <img width="583" height="607" alt="зображення" src="https://github.com/user-attachments/assets/8d155825-0fe4-40c5-88da-68a7d04c9b10" />

   * Waterfall Chart (факторний аналіз): наочно демонструє, які чинники вплинули на зміну прибутку порівняно з минулим роком. Зокрема, візуалізовано критичний інсайт: зниження ціни призвело до втрати 48% прибутку (-$39 424).

4. Розумна навігація та рекомендації
   * Smart Titles: під головним заголовком відображається динамічний текст, який описує всі застосовані фільтри (Дата, Сегмент, Категорія, Регіон). Наприклад, "East Performance in 2015 Category - Office Supplies", що виключає помилки в інтерпретації даних при застосуванні декількох фільтрів одночасно.
   * Стратегічний блок: Натискання на кнопку «інформація» (i) відкриває вікно з конкретними рекомендаціями (наприклад, фокус на високоприбуткових регіонах Заходу та Сходу або оптимізація асортименту в збиткових містах, таких як Х'юстон чи Філадельфія).
     
5. Стратегічні рекомендації. Через кнопку «Information» (i) доступний перелік дій для покращення показників:
    * Фокус на регіонах: Концентрувати інвестиції на Заході та Сході (Каліфорнія, Нью-Йорк, Вашингтон).
    * Оптимізація присутності: Скоротити діяльність у збиткових містах (Х'юстон, Сан-Антоніо, Філадельфія).
    * Розвиток категорій: Розширювати асортимент категорій Technology та Office Supplies (копіри, телефони, аксесуари).
    * Сегментація: Пріоритет на сегмент Consumer, який є найбільш прибутковим
    
Сторінка **Margin & Profitability** є спеціалізованим розділом дашборду, призначеним для глибокого аналізу фінансової ефективності та виявлення зон втрати прибутку. 
1. Панель ключових показників (KPI Cards)
У верхній частині сторінки розташовані чотири основні метрики, які дають швидку оцінку поточної ситуації:
    - Margin Leakage (Loss): відображає втрати маржі, з негативною динамікою -80.9%.
    - Revenue per Customer: Середній дохід на одного клієнта (2.90K), що зріс на 52.3%.
    - Avg Order Value: Середня вартість замовлення ($458,61).
    - Unprofitable Orders: Кількість збиткових замовлень (1318), яка зросла на 59.2%.
На відміну від головної сторінки, спарклайни на цих картках відображають тренд за всі доступні роки.

<img width="1177" height="660" alt="зображення" src="https://github.com/user-attachments/assets/b20b986d-37a0-4101-80b7-be06c193b9fb" />

2. Product Portfolio Matrix. Цей візуал у формі діаграми розсіювання (scatter plot) аналізує підкатегорії товарів за двома осями: загальний дохід (Total Revenue) та рівень маржі (Margin).
   * Контекстні підказки (Tooltips): При наведенні на точку (підкатегорію) відображається детальна інформація: обсяг продажів у грошах та одиницях, рівень маржі та назва квадранта (наприклад, "Volume Builders" для категорії Storage).
   * Класифікація: система автоматично групує товари залежно від їхнього внеску в прибуток та обсягу продажів, допомагаючи визначити стратегічно важливі позиції.

<img width="542" height="399" alt="Без імені" src="https://github.com/user-attachments/assets/bffa5191-6775-4ee4-b884-204a703d3f2e" />

3. Аналіз впливу знижок (Margin by Discount). Один із найважливіших графіків, що показує пряму залежність прибутковості від дисконтної політики:
   * Графік наочно демонструє, як маржа стає від’ємною при зростанні знижок. При знижці 80% збитки сягають -180%.
   * Регіональна деталізація: Через тултіп можна побачити, як знижки впливають на маржу в конкретних регіонах.
  
<img width="693" height="479" alt="зображення" src="https://github.com/user-attachments/assets/26d3aeeb-97ac-46f4-9844-0674ccc47ef0" />
     
4. Інтерактивні можливості та Drill-down:
   * Кнопка деталізації (i): кожна KPI-картка має іконку у верхньому правому куті. При натисканні на неї розгортається повноекранний графік Trend Unprofitable Orders (або іншої обраної метрики), де дані можна переглянути у розрізі кварталів, місяців та навіть окремих днів.

<img width="1075" height="600" alt="зображення" src="https://github.com/user-attachments/assets/62971bbc-7585-4467-8415-4e3be969343e" />

   * Регіональний аналіз: візуал Margin by Region and Category дозволяє порівняти прибутковість різних категорій у регіонах.
   * Динамічні заголовки: як і на Summary, під основною назвою сторінки відображається перелік усіх застосованих фільтрів, що забезпечує точність інтерпретації результатів

#### **2. Оптимізація LTV та юніт-економіки**

*   **Мета:** Аналіз прибутковості клієнтської бази та розробка стратегії стабілізації доходу

Ключові показники:
* Total Revenue: $481,41K
* LTV: $9,63K | CAC: $235
* LTV/CAC Ratio: 41x (висока рентабельність)

Аналіз сегментів та каналів:
* Returning ($10,7K LTV): Ядро бізнесу, найвищий ROI в каналі Email (до 47%)
* VIP ($10,5K LTV): Зона ризику; виявлено обвал доходу на 80% (лютий 2025), що вимагає переходу від знижок до ексклюзивного сервісу
* CRM Push: Найслабша ланка з найнижчим ROI (30–39%)

Стратегічні рішення:
* Автоматизація Retention: Lifecycle-програми через Email для росту LTV на 20%
* Оптимізація витрат: Скорочення частоти CRM Push для зниження CAC на 15%
* Стабілізація VIP: Заміна масових знижок на кешбек та персональні привілеї

**Результат:** сформовано план переходу від «дисконтної залежності» до прогнозованого зростання капіталізації бази.
   
<img width="1237" height="687" alt="image" src="https://github.com/user-attachments/assets/3cf520d8-7d65-4c36-ae86-24fdc3ea22b0" />

<img width="1245" height="692" alt="image" src="https://github.com/user-attachments/assets/2b60e34e-4920-4161-93cc-38182cb0791e" />

<img width="1235" height="691" alt="image" src="https://github.com/user-attachments/assets/deececc1-3785-43a4-9a7d-298c8a6b384b" />

      

